In [4]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.svm import SVC
from sklearn import svm
%matplotlib inline

In [6]:
company = pd.read_csv('C:/Users/sonku/Downloads/Boffins/Company/Salaries.csv') #Reads csv file into dataframe.

In [7]:
company.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Company   30 non-null     object
 1   Profile   30 non-null     object
 2   Alumni    30 non-null     int64
 3   Year      30 non-null     int64
 4   Salaries  30 non-null     int64
dtypes: int64(3), object(2)
memory usage: 1.3+ KB

In [8]:
company.head()

   Company         Profile  Alumni  Year  Salaries
0  Infosys  Data Scientist       1  2011    120000
1  Infosys  Data Scientist       2  2011    130000
2  Infosys  Data Scientist       3  2011    140000
3  Infosys  Data Scientist       4  2011    200000
4  Infosys  Data Scientist       5  2011    100000

In [10]:
company['Salaries'].value_counts()

150000    3
200000    3
100000    2
160000    2
120000    2
190000    2
95000     2
155000    1
170000    1
125000    1
130000    1
220000    1
135000    1
92000     1
175000    1
85000     1
110000    1
90000     1
80000     1
165000    1
140000    1
Name: Salaries, dtype: int64